Repository: sds95/encryption-study
Catalog: EncryptionStudy/Tests.*.resx
Languages: ru_ru

# Answer10_1
source: a) Independent blocks encryption
ru_ru: a) Шифрование независимыми блоками

# Answer10_2
source: b) Encryption, dependent on the previous blocks
ru_ru: b) Шифрование, зависящее от предыдущих блоков

# Answer10_3
source: c) Whole block completion
ru_ru: c) Дополнение до целого блока

# Answer11_1
source: a) A recipient will not be able to find the end of useful data
ru_ru: a) Получатель не сможет найти конец полезных данных

# Answer11_2
source: b) There is a risk of information leak
ru_ru: b) Есть риск утечки информации

# Answer11_3
source: c) There is no correct answer
ru_ru: c) Нет верного ответа

# Answer12_1
source: a) Substitution, permutation, XOR ciphers
ru_ru: a) Замены, перестановки, гаммирования, составные

# Answer12_2
source: b) Symmetric, asymmetric and streamer ciphers
ru_ru: b) Симметричные, ассиметричные и потоковые

# Answer12_3
source: c) Substitution and permutation ciphers
ru_ru: c) Замены и перестановки

# Answer13_1
source: a) A method of cryptographic conversion, which lies in a swap of initial text symbols according to a certain rule
ru_ru: a) Метод криптографического преобразования, заключающийся в перестановке местами символов исходного текста по некоторому правилу

# Answer13_2
source: b) A system of block substitution
ru_ru: b) Система подстановки блоков

# Answer13_3
source: c) A method of conversion, which lies in a substitution of initial text symbols to another ones.
ru_ru: c) Метод преобразований, заключающийся в замене символов исходного текста на другие

# Answer14_1
source: a) XOR cipher
ru_ru: a) Гаммирования

# Answer14_2
source: b) Streamer cipher
ru_ru: b) Потоковый

# Answer14_3
source: c) Substitution cipher
ru_ru: c) Замены

# Answer15_1
source: a) Block encryption
ru_ru: a) Блоковому шифрованию

# Answer15_2
source: b) Streamer encryption
ru_ru: b) Потоковому шифрованию

# Answer15_3
source: c) To the both types of encryption
ru_ru: c) К обоим видам шифрования

# Answer16_1
source: a) A symmetric algorithm works slower than an asymmetric one
ru_ru: a) Симметричный алгоритм работает медленнее ассиметричного

# Answer16_2
source: b) An asymmetric algorithm works slower than a symmetric one
ru_ru: b) Ассиметричный алгоритм работает медленнее симметричного

# Answer16_3
source: c) Both algorithms require lots of computational resources
ru_ru: c) Оба алгоритма при работе требуют много вычислительных ресурсов

# Answer18_1
source: a) The same cryptographic strength as the strongest cipher it uses
ru_ru: a) Такую же криптоустойчивость как и сильнейший из используемых им шифров

# Answer18_2
source: b) The same cryptographic strength as the weakest cipher it uses
ru_ru: b) Такую же криптоустойчивость как и слабейший из используемых им шифров

# Answer18_3
source: c) Cryptographic strength depends on all the ciphers used
ru_ru: c) Криптоустойчивость зависит от всех используемых им шифров

# Answer19_1
source: a) Secret information, used by a cryptographic algorithm while encrypting/ decrypting of the message
ru_ru: a) Секретная информация, используемая криптографическим алгоритмом при шифровании/расшифровке сообщений

# Answer19_2
source: b) Randomly generated key of a symmetric cipher for a hybrid encryption
ru_ru: b) Случайно генерирующийся ключ симметричного шифра для гибридного шифрования

# Answer19_3
source: c) There is no correct answer
ru_ru: c) Нет верного ответа

# Answer20_1
source: a)A conversion, when symbols of an initial text are folded according to a module, which is equal in capacity with the alphabet, with symbols of pseudo-random sequence
ru_ru: a) Преобразование, при котором символы исходного текста складываются по модулю, равному мощности алфавита, с символами псевдослучайной последовательности

# Answer20_2
source: b) A XOR form, which converses an open text into encrypted one subsequently, bite by bite.
ru_ru: b) Разновидность гаммирования которая преобразует открытый текст в шифрованный последовательно, по одному биту

# Answer20_3
source: c) There is no correct answer
ru_ru: c) Нет правильного ответа

# Answer2_1
source: a) measures to restrict access to information
ru_ru: a) меры для ограничения доступа к информации

# Answer2_2
source: b) verification of authenticity and intactness of information
ru_ru: b) удостоверения подлинности и неизменности информации

# Answer2_3
source: c) both variants are correct
ru_ru: c) оба варианта верны

# Answer3_1
source: a) Cheapness
ru_ru: a) Дешевизна

# Answer3_2
source: b) A list of possible threats
ru_ru: b) Перечень вероятных угроз

# Answer3_3
source: c) Necessity of protection
ru_ru: c) Необходимость в защите

# Answer4_1
source: a) A secret text for encryption/decryption of the message
ru_ru: a) Секретный текст для шифрования/расшифровки сообщения

# Answer4_2
source: b) A secret formula for encryption/decryption of the message
ru_ru: b) Секретная формула для шифрования/расшифровки сообщения

# Answer4_3
source: c) A secret information for encryption/decryption of the message
ru_ru: c) Секретная информация для шифрования/расшифровки сообщения

# Answer5_1
source: a) Symmetric has only one key, while asymmetric has 2 keys
ru_ru: a) В симметричном один ключ, а ассиметричном 2 ключа

# Answer5_2
source: b) Symmetric has two keys, while asymmetric has one
ru_ru: b) В симметричном два ключа, а ассиметричном 1 ключ

# Answer5_3
source: c) There are no differences
ru_ru: c) Нет отличий

# Answer6_1
source: a) Symmetric encryption
ru_ru: a) Симметричное шифрование

# Answer6_2
source: b) Asymmetric encryption
ru_ru: b) Ассиметричное шифрование

# Answer6_3
source: c) Both types of encryption
ru_ru: c) Оба вида шифрования

# Answer7_1
source: a) A study of methods of detection of vulnerable places in an algorithm
ru_ru: a) Наука о методах нахождения уязвимых мест в алгоритме шифрования

# Answer7_2
source: b) A study of methods of initial text detection
ru_ru: b) Наука о методах нахождения исходного текста

# Answer7_3
source: c) Both variants are correct
ru_ru: c) Оба варианта верны

# Answer8_1
source: a) The text is divided only into 2 blocks
ru_ru: a) Текст делиться на только на 2 блока

# Answer8_2
source: b) The text is divided into a great amount of blocks of different length
ru_ru: b) Текст делиться на большое количество разных по длине блоков

# Answer8_3
source: c) The text is divided into equal blocks
ru_ru: c) Текст делиться на равные блоки

# Answer9_1
source: a) Encryption is impossible
ru_ru: a) Шифрование не возможно

# Answer9_2
source: b) Block is completed to the necessary length
ru_ru: b) Блок дополняется до нужной длинны

# Answer9_3
source: c) Unfilled block does not participate in encryption
ru_ru: c) Незаполненный блок не участвует в шифровании

# Question1
source: How many aspects of protection exist?
ru_ru: Количество аспектов защиты?

# Question10
source: In which of the methods the unfinished block is filled with zero ones and a single bite?
ru_ru: В каком из методов незавершенный блок заполняется нулевыми, и единичным битом.

# Question11
source: Why independent blocks encryption is not efficient when dealing with great amounts of information?
ru_ru: Почему шифрование независимыми блоками не эффективно при большом количестве информации?

# Question12
source: Block ciphers are divided into:
ru_ru: Блоковые шифры делятся на

# Question13
source: Substitution cipher is –
ru_ru: Шифр подстановки это –

# Question14
source: The simplest block cipher is-
ru_ru: Простейший блоковый шифр

# Question15
source: XOR is related to
ru_ru: Гаммирование относиться к

# Question16
source: Mark the correct statement
ru_ru: Укажите верное утверждение

# Question17
source: The number of ways of block encryption is
ru_ru: Количество способов блочного шифрования

# Question18
source: Hybrid key has
ru_ru: Гибридный шифр имеет

# Question19
source: Session key is-
ru_ru: Сеансовый ключ это

# Question2
source: The protection of information means-
ru_ru: Защита информации это –

# Question20
source: Permutation cipher is
ru_ru: Шифр перестановки это

# Question3
source: The principle of the second aspect of information security
ru_ru: Принцип второго аспекта защиты информации

# Question4
source: A key is-
ru_ru: Ключ это –

# Question5
source: What is the difference between a symmetric encryption and an asymmetric one?
ru_ru: Отличие симметричного шифрования и ассиметричного?

# Question6
source: Hybrid cipher uses:
ru_ru: Гибридный шифр использует:

# Question7
source: Cryptanalysis is-
ru_ru: Криптоанализ – это

# Question8
source: The peculiarity of block encryption is-
ru_ru: Особенность блочного шифрования

# Question9
source: If the length of a message is less than the length of a block, then
ru_ru: Если длина сообщения меньше длины блока, то
